app/Controllers/Driver.php

SELECT *
FROM `drivers`
---
    public function index()
    {
        $data = [
            'title' => 'Driver Page',
            'driver' => $this->driver->findAll()