app/Controllers/Product.php

    public function index()
    {

        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $this->product->search($keyword);
        } else {
            $this->product;
        }

        $data = [
            'title' => 'Product Page',
            'item' => $this->product->findAll()
---
SELECT *
FROM `products`